Ran Plan for dir: `terraform/fileflow` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/65/default/terraform/fileflow/fileflow-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/65/default/terraform/fileflow": exit status 1
data.aws_kms_key.cloudwatch-logs: Reading...
data.aws_db_instance.main: Reading...
data.aws_kms_key.secrets-manager: Reading...
data.aws_vpc.main: Reading...
data.aws_kms_key.ecs-secrets: Reading...
data.aws_secretsmanager_secret.db-master-password: Reading...
data.aws_kms_key.secrets-manager: Read complete after 0s [id=c864126f-d148-41ef-80eb-ed41a8edb2c4]
data.aws_kms_key.cloudwatch-logs: Read complete after 0s [id=46ee44d3-866f-4029-b456-338f482eb1cb]
data.aws_kms_key.ecs-secrets: Read complete after 0s [id=6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a]
data.aws_vpc.main: Read complete after 1s [id=vpc-0f162b9e588276e09]
data.aws_subnets.public: Reading...
data.aws_subnets.private: Reading...
data.aws_subnets.public: Read complete after 0s [id=ap-northeast-2]
data.aws_subnets.private: Read complete after 0s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_appautoscaling_policy.ecs-cpu will be created
  + resource "aws_appautoscaling_policy" "ecs-cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fileflow-cpu-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.ecs-memory will be created
  + resource "aws_appautoscaling_policy" "ecs-memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fileflow-memory-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.ecs will be created
  + resource "aws_appautoscaling_target" "ecs" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/fileflow-cluster/fileflow-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "ManagedBy" = "Terraform"
          + "Module"    = "fileflow"
        }
    }

  # aws_cloudwatch_log_group.fileflow will be created
  + resource "aws_cloudwatch_log_group" "fileflow" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/fileflow"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-logs"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all          = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-logs"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "fileflow-cluster"
      + tags     = {
          + "Component"   = "ecs-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-cluster"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all = {
          + "Component"   = "ecs-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-cluster"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.fileflow will be created
  + resource "aws_ecs_service" "fileflow" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fileflow-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Component"   = "ecs-service"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-service"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "Component"   = "ecs-service"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-service"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "fileflow"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
        }
    }

  # aws_ecs_task_definition.fileflow will be created
  + resource "aws_ecs_task_definition" "fileflow" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "fileflow"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Component"   = "ecs-task-definition"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-task-definition"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                 = {
          + "Component"   = "ecs-task-definition"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-task-definition"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs-task will be created
  + resource "aws_iam_role" "ecs-task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fileflow-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-ecs-task-role"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-ecs-task-role"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs-task-execution will be created
  + resource "aws_iam_role" "ecs-task-execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fileflow-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-ecs-task-execution-role"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-ecs-task-execution-role"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs-task-execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "fileflow-ecs-task-execution-role"
    }

  # aws_lb.fileflow will be created
  + resource "aws_lb" "fileflow" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "fileflow-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                     = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                              = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.fileflow will be created
  + resource "aws_lb_target_group" "fileflow" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "fileflow-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-target-group"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-target-group"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f162b9e588276e09"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # aws_secretsmanager_secret.fileflow-db will be created
  + resource "aws_secretsmanager_secret" "fileflow-db" {
      + arn                            = (known after apply)
      + description                    = "FileFlow database credentials and connection information"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:ap-northeast-2:646886795421:key/c864126f-d148-41ef-80eb-ed41a8edb2c4"
      + name                           = "fileflow/database/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                       = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for FileFlow Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "fileflow-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-alb-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all               = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-alb-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # aws_security_group.ecs-tasks will be created
  + resource "aws_security_group" "ecs-tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for FileFlow ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "fileflow-ecs-tasks"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-ecs-tasks-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all               = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-ecs-tasks-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_arn                     = (known after apply)
  + alb_dns_name                = (known after apply)
  + alb_security_group_id       = (known after apply)
  + alb_zone_id                 = (known after apply)
  + database_secret_arn         = (known after apply)
  + database_secret_name        = "fileflow/database/credentials"
  + ecs_cluster_arn             = (known after apply)
  + ecs_cluster_id              = (known after apply)
  + ecs_cluster_name            = "fileflow-cluster"
  + ecs_security_group_id       = (known after apply)
  + ecs_service_id              = (known after apply)
  + ecs_service_name            = "fileflow-service"
  + ecs_task_execution_role_arn = (known after apply)
  + ecs_task_role_arn           = (known after apply)
  + health_check_url            = (known after apply)
  + log_group_arn               = (known after apply)
  + log_group_name              = "/aws/ecs/fileflow"
  + service_url                 = (known after apply)
  + target_group_arn            = (known after apply)
  + task_definition_arn         = (known after apply)
╷
│ Error: reading RDS DB Instance (prod-server): operation error RDS: DescribeDBInstances, https response error StatusCode: 403, RequestID: 20245c18-2ecf-4fda-a2ca-c718e3365960, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/6085d887dc454339970d4535ab6315fe is not authorized to perform: rds:DescribeDBInstances on resource: arn:aws:rds:ap-northeast-2:646886795421:db:prod-server because no identity-based policy allows the rds:DescribeDBInstances action
│ 
│   with data.aws_db_instance.main,
│   on data.tf line 58, in data "aws_db_instance" "main":
│   58: data "aws_db_instance" "main" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (rds/prod-server/master-credentials): couldn't find resource
│ 
│   with data.aws_secretsmanager_secret.db-master-password,
│   on data.tf line 62, in data "aws_secretsmanager_secret" "db-master-password":
│   62: data "aws_secretsmanager_secret" "db-master-password" {
│ 
╵

```
</details>